app/controllers/challenges_controller.rb

SELECT "challenges".* FROM "challenges"
---
  def index
    @challenges = Challenge.all

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "mew"]]
---
  def show
    @challenge = Challenge.find(params[:id])

INSERT INTO "challenges" ("created_at", "difficulty", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 02 Dec 2013 22:54:29 UTC +00:00], ["difficulty", 3], ["name", "britney songs"], ["updated_at", Mon, 02 Dec 2013 22:54:29 UTC +00:00]]
---
  def create
    @challenge = Challenge.create(challenge_params)

SELECT "challenges".* FROM "challenges"
---
  def welcome
    @challenges = Challenge.all

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "9"]]
---
  def invite_friends_form
    @challenge = Challenge.find(params[:id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "9"]]
---
  def invite_friends
    @challenge = Challenge.find(params[:id])

SELECT "challenges".* FROM "challenges" ORDER BY "challenges"."id" DESC LIMIT 5
---
  def set_challenges
      @popular_challenges = Challenge.last(5)