app/controllers/sessions_controller.rb

INSERT INTO "users" ("created_at", "name", "provider", "uid", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 03 Dec 2013 20:55:08 UTC +00:00], ["name", "Mike Spangler"], ["provider", "rdio"], ["uid", "s16661379"], ["updated_at", Tue, 03 Dec 2013 20:55:08 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."provider" = 'rdio' AND "users"."uid" = 's16661379' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)