app/controllers/songs_controller.rb

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "29"]]
---
  def search_songs
    @challenge = Challenge.find(params[:id])

SELECT "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", "36"]]
---
  def song_results
    @challenge = Challenge.find(params[:id])